### Goal

In [18]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [19]:
import os, sys
import pandas as pd
import math
import numpy as np

sys.path.append('../notebooks/')
import helper as hp

In [20]:
savepath = "ra_hair/"
os.makedirs(savepath, exist_ok=True)

In [21]:
df_mm = pd.read_excel(f"{savepath}michael.xlsx")
df_dn = pd.read_excel(f"{savepath}devora.xlsx")
df_sk = pd.read_excel(f"{savepath}suneesh.xlsx")

In [22]:
df_mm.head(2)

,CV name,Unnamed: 1,Ranking,Note,Flag
0,Jamie_20_Travassos_20Jr_Resume_202,JAMIE TRAVASSOS JR,9,NaN,NaN
1,Amanda_20Suarez_20Resume_20Summer_202024,Amanda Su치rez,8,NaN,NaN

In [23]:
df_mm.rename(columns={'Unnamed: 1': 'Name'}, inplace=True)
df_mm.rename(columns={'Ranking': 'Score'}, inplace=True)
df_mm.head(2)

,CV name,Name,Score,Note,Flag
0,Jamie_20_Travassos_20Jr_Resume_202,JAMIE TRAVASSOS JR,9,NaN,NaN
1,Amanda_20Suarez_20Resume_20Summer_202024,Amanda Su치rez,8,NaN,NaN

In [24]:
df_dn.head(2)

             Name  Score (1=worst, 10=best)            Notes
0      xiangyu Gu                         6  for MB position
1  Vasavi Bhogadi                         5       ? confused

In [25]:
df_dn.rename(columns={'Score (1=worst, 10=best)': 'Score'}, inplace=True)
df_dn.head(2)

             Name  Score            Notes
0      xiangyu Gu      6  for MB position
1  Vasavi Bhogadi      5       ? confused

In [26]:
df_sk.head(2)

,Name,Degree,Score,Comments
0,NaN,NaN,NaN,NaN
1,Satya Nikhil Talagadadevi,MS,5.0,May be a fit fot our Chemistry/biology combin...

In [27]:
df_sk = df_sk.drop(0)
df_sk.head(2)

,Name,Degree,Score,Comments
1,Satya Nikhil Talagadadevi,MS,5.0,May be a fit fot our Chemistry/biology combin...
2,Nandita Shrayoshi,NaN,NaN,NaN

In [28]:
print(len(df_mm), len(df_dn), len(df_sk))

180 167 168

In [33]:
df_merged = pd.merge(df_mm, df_dn, on='Name', how='outer')
df_merged.head(2)

                 Name  Score_x  Score_y
0  JAMIE TRAVASSOS JR      9.0      5.0
1       Amanda Su치rez      8.0      8.0

In [34]:
df_merged = pd.merge(df_merged, df_sk, on='Name', how='outer')
df_merged.head(2)

                 Name  Score_x  Score_y  Score
0  JAMIE TRAVASSOS JR      9.0      5.0    1.0
1       Amanda Su치rez      8.0      8.0    NaN

In [35]:
len(df_merged)

230

ok we have too many difference in names..

In [ ]:
# d,s,m
bio = {"Jazmine Richardson": [9, 4, 7],
       "NRUPA DINESH PATEL": [9, 4, 4],
       "Isabelle Nguyen": [9, 7, 3],
       "MOHAMMED HASEEB NAWAZ": [9, 5, 6],
       "Livia Skende": [9, 6, 8]}